#include<stdio.h>
main()
{
	int a[3], * p;
	p = a;
	a[0] = 10, a[1] = 20, a[2] = 30;
	printf("*p・・・%d\n", *p);
	p = a;
	a[0] = 10, a[1] = 20, a[2] = 30;
	printf("*p+1・・・%d\n", *p+1);
	p = a;
	a[0] = 10, a[1] = 20, a[2] = 30;
	printf("*(p+1)・・・%d\n", *(p+1));
	p = a;
	a[0] = 10, a[1] = 20, a[2] = 30;
	printf("*p+=1・・・%d\n", *p+=1);
	p = a;
	a[0] = 10, a[1] = 20, a[2] = 30;
	printf("*p++・・・%d\n", *p++);		//後起き
	p = a;
	a[0] = 10, a[1] = 20, a[2] = 30;
	printf("(*p)++・・・%d\n", (*p)++);	//あとおきは他の処理が先に行われる
	p = a;
	a[0] = 10, a[1] = 20, a[2] = 30;
	printf("*++p・・・%d\n", *++p);	//先置きは先に計算される
	p = a;
	a[0] = 10, a[1] = 20, a[2] = 30;
	printf("++*p・・・%d\n", ++*p);	//先置き
}